post-init.org
#+TITLE: emacs config
#+auto_tangle: t

这是 =post-init.el= 和 =pre-early-init.el= 的文学编程配置.
 ~C-c C-v~ 系列快捷键来使用trangle的功能(比如 ~C-c C-v C-t~ 把本文件的代码写入.)
=C-c '= 

* pre-early-init.el

#+begin_src emacs-lisp :tangle ./pre-early-init.el
        ;;; FILENAME.el --- DESCRIPTION -*- no-byte-compile: t; lexical-binding: t; -*-
                                          ;(setq debug-on-error t)
  ;; use-package



  (eval-when-compile
    (require 'use-package))

  ;;更新内置包
  ;;  (setq package-install-upgrade-built-in t)

  ;;不验证签名
  (setq package-check-signature nil)
  ;; melpa 和 host
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("gnu"   . "https://elpa.gnu.org/packages/") t)

  (setq url-proxy-services '(("no_proxy" . "^\\(192\\.168\\..*\\)")
                             ("http" . "127.0.0.1:7897")
                             ("https" . "127.0.0.1:7897")))


      ;;; Reducing clutter in ~/.emacs.d by redirecting files to ~/.emacs.d/var/
  ;; NOTE: This must be placed in 'pre-early-init.el'.
  (setq user-emacs-directory (expand-file-name "var/" minimal-emacs-user-directory))
  (setq package-user-dir (expand-file-name "elpa" user-emacs-directory))

  ;; 移除的标题栏
  ;;(add-to-list 'default-frame-alist '(undecorated . t))
    
    (provide 'pre-early-init.el)
      ;;; pre-early-init.el ends here
#+end_src

* post-init.el 开头
benchmark 用来分析启动时间
#+begin_src emacs-lisp :tangle ./post-init.el
    ;;; post-init.el --- Emacs Configuration -*- no-byte-compile: t; lexical-binding: t; -*-
     ;; (use-package benchmark-init
     ;; :ensure t
     ;; :config
     ;; (add-hook 'after-init-hook 'benchmark-init/deactivate))


#+end_src

* 内置、内置包 




#+begin_src emacs-lisp :tangle ./post-init.el



  (setq use-package-always-ensure t)  ;; 默认自动安装包
  (setq use-package-always-defer t)   ;; 默认延迟加载



  ;; 文件编码
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)

  ;; 编辑体验
  (setq-default tab-width 4)
  (setq-default indent-tabs-mode nil)       ;; 使用空格而非 Tab
  (setq require-final-newline t)            ;; 文件末尾自动添加换行
  (setq truncate-lines nil)                 ;; 自动换行
  ;;  (global-hl-line-mode 1)                   ;; 高亮当前行
  (show-paren-mode 1)                       ;; 显示匹配括号
  (electric-pair-mode 1)                    ;; 自动配对括号
  (delete-selection-mode 1)                 ;; 选中文本后输入会替换
  (global-auto-revert-mode 1)               ;; 自动刷新文件
  ;;  (setq display-line-numbers-type 'relative)  ;显示相对行号
  ;;    (global-display-line-numbers-mode 1)

  ;; 对选中文本使用括号引号自动放入
  ;; 备份和自动保存
  ;; (setq auto-save-default nil)
  ;; (setq auto-save-interval 300)
  ;; (setq auto-save-timeout 30)
  ;; (setq make-backup-files t)
  ;; (setq backup-directory-alist
  ;;       `(("." . ,(expand-file-name "backups" user-emacs-directory))))
  ;; (setq auto-save-file-name-transforms
  ;;       `((".*" ,(expand-file-name "auto-saves/" user-emacs-directory) t)))
  (auto-save-visited-mode 1)
  (setq auto-save-timeout 20)
  ;; 历史记录
  (savehist-mode 1)
  (save-place-mode 1)
  (recentf-mode 1)
  (setq recentf-max-saved-items 100)
  (setq history-length 500)
  ;; 启动全屏
  (add-hook 'emacs-startup-hook #'toggle-frame-maximized)

  (setq recent-keys-length 1000)          ;C-h l 保存的历史快捷键数量
#+end_src
* load各项功能
#+begin_src emacs-lisp :tangle ./post-init.el
  (add-to-list 'load-path "~/.emacs.d/lisp/")
#+end_src

[[file:lisp/my-dashboard.org]]
#+begin_src emacs-lisp :tangle ./post-init.el

  (require 'my-dashboard)
  ;;(load "~/.emacs.d/lisp/my-dash.el")

#+end_src


[[file:lisp/my-org-mode.org]]
#+begin_src emacs-lisp :tangle ./post-init.el

  (require ' my-org-mode)

  (require ' my-ebook-reader)
#+end_src
** use-package emacs

新frame自动全屏
#+begin_src emacs-lisp :tangle ./post-init.el
  (use-package emacs
    :bind (("M-o" . other-window)
           ("s-o" . other-frame))
    :hook (after-make-frame-functions . (lambda (frame)
                                          (select-frame frame)
                                          (toggle-frame-maximized))))
    #+end_src

从systemcrafet处偷的配置：[[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][Emacs Configuration]]

#+begin_src emacs-lisp :tangle ./post-init.el
  ;; steal from system crafter
  (setq large-file-warning-threshold nil)
  (column-number-mode 1) 
#+end_src


** 小优化配置
*** 温和一点点的 C-backspc 删词
CLOSED: [2026-03-04 水 23:21]
- State "DONE"       from "TODO"       [2026-03-04 水 23:21]
#+begin_src emacs-lisp :tangle ./post-init.el

  (global-subword-mode 1)

  ;; (use-package hungry-delete
  ;; :config
  ;; (global-hungry-delete-mode))



  (defun my/backward-kill-word ()
    "中英混排友好的向后删词，其余行为与默认 C-backspace 完全一致。"
    (interactive)
    (let ((ch (char-before)))
      (if (and ch (string-match-p "[\\u3000-\\u9fff\\uff00-\\uffef]" (string ch)))
          ;; 只有光标前是中日文时，删连续中日字符
          (delete-region (point)
                         (save-excursion
                           (while (and (not (bobp))
                                       (string-match-p "[\\u3000-\\u9fff\\uff00-\\uffef]"
                                                       (string (char-before))))
                             (backward-char))
                           (point)))
        ;; 其他一切交给原生            
        (backward-kill-word 1))))

  (global-set-key (kbd "C-<backspace>") #'my/backward-kill-word)
#+end_src
*** beacon 我的光标在哪？
#+begin_src emacs-lisp :tangle ./post-init.el

  (use-package beacon
    :defer 0.5
    :config
    (beacon-mode 1)
    ;; 可选配置
    (setq beacon-color "#4a5060")      
    (setq beacon-size 20)              
    (setq beacon-blink-duration 0.3))  
#+end_src
*** 翻页优化
#+begin_src emacs-lisp :tangle ./post-init.el

  ;; 翻页保留5行重叠，不显得太跳
  (setq next-screen-context-lines 5)

  ;; 滚动时距边缘保留3行
  (setq scroll-margin 3)

  ;; 避免翻页时重新居中
  (setq scroll-conservatively 101)

  ;; 翻页时光标跟着走，不乱跳
  (setq scroll-preserve-screen-position t)
  ;; other-window 保持一致
  (setq other-window-scroll-default nil)
  (setq scroll-other-window-lines 3)
  ;; 像素级平滑滚动
  (pixel-scroll-precision-mode 1)
#+end_src

** 字体 主题 emacs的图标
*** 字体
#+begin_src emacs-lisp :tangle ./post-init.el

  (custom-set-faces
   '(gnus-group-news-low ((t (:foreground "cyan"))))
   '(gnus-group-news-low-empty ((t (:foreground "cyan" :weight normal)))))

  (use-package nerd-icons
    ;; :custom
    ;; The Nerd Font you want to use in GUI
    ;; "Symbols Nerd Font Mono" is the default and is recommended
    ;; but you can use any other Nerd Font if you want
    ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
    )



  (defun my/setup-fonts ()
    "设置字体配置."
    (when (display-graphic-p)
      ;; 英文字体
      (set-face-attribute 'default nil
                          :height 130          
                          :weight 'normal
                          :family "DejaVu Sans mono")
      
      (dolist (charset '(kana han symbol cjk-misc bopomofo))
        (set-fontset-font t charset
                          (font-spec :family "Sarasa Fixed SC"
                                     )))))

  (use-package valign
  :hook (org-mode . valign-mode))         ;解决像素级对齐，让org sheet可以用中日文也对齐了

  ;;(add-to-list 'default-frame-alist '(undecorated . t))


  ;; 延迟加载字体设置
  (add-hook 'after-init-hook #'my/setup-fonts)
#+end_src

| 分wo      |
| 人        |
| pw        |
| あ        |
| あいうえお |
| english!  |
|           |
*** 主题
用来用去,感觉doom的默认主题是最好的,因为这个主题用的人最多,所以调教得也最多,性能和兼容性可能有点问题但是视觉效果是最好的.
我也用过很久ef themes,但是稍逊于doom theme.

字体安装： =sudo pacman -S ttf-sarasa-gothic= 

#+begin_src emacs-lisp :tangle ./post-init.el

    (use-package doom-themes
      :demand t
      :custom
      ;; Global settings (defaults)
      (doom-themes-enable-bold t)   ; if nil, bold is universally disabled
      (doom-themes-enable-italic t) ; if nil, italics is universally disabled
      ;; for treemacs users
      (doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
      :config
      (load-theme 'doom-vibrant t)
                                            ;  (load-theme 'doom-nord t)
                                            ;  (load-theme 'doom-solarized-light t)

      ;; Enable flashing mode-line on errors
      (doom-themes-visual-bell-config)
      ;; Enable custom neotree theme (nerd-icons must be installed!)
      (doom-themes-neotree-config)
      ;; or for treemacs users
      (doom-themes-treemacs-config)
      ;; Corrects (and improves) org-mode's native fontification.

      (doom-themes-org-config))




    (use-package doom-modeline
      :init (doom-modeline-mode 1)    )



    ;; 备用的其他主题配置
    ;; (use-package ef-themes
    ;;  :demand t
    ;;  :bind (("<f5>" . modus-themes-rotate)
    ;;         ("C-<f5>" . modus-themes-select)
    ;;         ("M-<f5>" . modus-themes-load-random))
    ;;  :init
    ;;  (setq modus-themes-mixed-fonts t
    ;;        modus-themes-italic-constructs t)
    ;;  :config
    ;;  (setq ef-owl-palette-overrides
    ;;        '((bg-region "#1a3f4a")))
    ;;  
    ;;  (ef-themes-load-theme 'ef-owl))

    ;; (use-package mood-line
    ;; :hook (after-init . mood-line-mode))


  
#+end_src
