post-init.org
* 工作区管理
使用内置的tab-bar进行工作区管理和切换,我把tab-bar的显示关掉了.
#+begin_src emacs-lisp :tangle ./post-init.el

  (use-package tab-bar
    :ensure nil
    :demand t
    :bind (
           ("C-c s" . tab-bar-switch-to-tab)
           ("C-c V" . tab-bar-close-tab)
           )
    :custom
    (tab-bar-show nil)
    (tab-bar-tab-hints t)
    (tab-bar-new-tab-choice "*dashboard*")
    :init
    (tab-bar-mode 1))

  (use-package burly
    :after tab-bar
    :bind
    (("C-c v" . my/create-workspace)
     ("C-c r" . my/save-workspace)
     )
    :config
    (defun my/create-workspace ()
      "创建新的工作区标签."
      (interactive)
      (tab-bar-new-tab)
      (let ((name (read-string "Workspace name: ")))
        (tab-bar-rename-tab name)))

    (defun my/save-workspace ()
      "保存当前标签的窗口布局."
      (interactive)
      (burly-bookmark-windows
       (format "tab-%s" (alist-get 'name (tab-bar--current-tab))))))
#+end_src
* 自动恢复相关
#+begin_src emacs-lisp :tangle ./post-init.el
  (use-package autorevert
    :ensure nil
    :demand t
    :custom
    (auto-revert-interval 3)
    (auto-revert-remote-files nil)
    (auto-revert-use-notify t)
    (auto-revert-verbose nil)
    :config
    (global-auto-revert-mode 1))

  (use-package recentf
    :ensure nil
    :demand t
    :custom
    (recentf-auto-cleanup (if (daemonp) 300 'never))
    (recentf-max-saved-items 100)
    (recentf-exclude
     '("\\.tar$" "\\.tbz2$" "\\.tgz$" "\\.bz2$" "\\.gz$"
       "\\.zip$" "\\.7z$" "\\.rar$"
       "COMMIT_EDITMSG\\'"
       "\\.\\(?:gif\\|svg\\|png\\|jpe?g\\|bmp\\|xpm\\)$"
       "-autoloads\\.el$" "autoload\\.el$"))
    :config
    (recentf-mode 1)
    (add-hook 'kill-emacs-hook #'recentf-cleanup -90))

  (use-package savehist
    :ensure nil
    :demand t
    :custom
    (savehist-autosave-interval 600)
    (savehist-additional-variables
     '(kill-ring
       register-alist
       mark-ring
       global-mark-ring
       search-ring
       regexp-search-ring
       corfu-history
       vertico-repeat-history))
    :config
    (savehist-mode 1))

  (use-package saveplace
    :ensure nil
    :demand t
    :custom
    (save-place-limit 400)
    :config
    (save-place-mode 1))
#+END_SRC
* use-packages

** multiple-cursors and undo-fu 
#+begin_src emacs-lisp :tangle ./post-init.el

  (use-package multiple-cursors
    :ensure t
    :bind
    (;; 最常用操作：选中词 → 连续按这个键添加相似光标
     ("C->"     . mc/mark-next-like-this)
     ("C-<"     . mc/mark-prev-like-this)
     ;; 选中一个词后按这个 → 全缓冲区相同词都加光标
     ("C-c C->" . mc/mark-all-like-this)

     ;; 选中多行后 → 每行都出现光标（最实用的批量编辑）
     ("C-S-c C-S-c" . mc/edit-lines)

     ;; 其他常用（可选）
     ("M-<down-mouse-1>" . mc/add-cursor-on-click)   ; 鼠标点哪哪出现光标（很爽）
     ("C-!"          . mc/mark-all-dwim)            ; 智能全选（有区域就选区域，没区域就选全部）
     )

    :config
    ;; 建议：让这些常用命令在 mc 模式下也能正常工作
    (add-to-list 'mc/cmds-to-run-for-all 'forward-char)
    (add-to-list 'mc/cmds-to-run-for-all 'backward-char)
    (add-to-list 'mc/cmds-to-run-for-all 'delete-char)
    (add-to-list 'mc/cmds-to-run-for-all 'backward-delete-char)
    )



  (use-package undo-fu
    :init
    (global-unset-key (kbd "C-z"))
    :bind
    ("C-/"   . undo-fu-only-undo)
    ("C-S-/" . undo-fu-only-redo)
    ("C-z"   . undo-fu-only-undo)
    ("C-S-z" . undo-fu-only-redo)
    )

  (use-package undo-fu-session
    :ensure t
    :config
    (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
    (setq undo-strong-limit (* 16 1024 1024))
    (setq undo-fu-session-compression 'gz)
    (undo-fu-session-global-mode))

#+end_src
** yasnippet
emacs-lisp_

#+begin_src emacs-lisp :tangle ./post-init.el

  ;; 关闭 小于号自动补全大于号
  (setq electric-pair-inhibit-predicate
        (lambda (c)
          (if (char-equal c ?<) t (electric-pair-default-inhibit c))))

  (use-package yasnippet
    :bind(("C-c p TAB" . yas-expand)
           ("C-c p i" . yas-insert-snippet)
           ("C-c p n" . yas-new-snippet)
           ("C-c p v" . yas-visit-snippet-file))
    
    :hook
    ;; 在常用模式下启用
    ((prog-mode . yas-minor-mode)
     (text-mode . yas-minor-mode)
     (org-mode  . yas-minor-mode))
    :config
    ;; 自定义 snippets 目录（与内置目录共存）
    (setq yas-snippet-dirs
          '("~/.emacs.d/snippets"           ; 个人自定义 snippets
            yasnippet-snippets-dir))         ; 官方 snippet 集合（见下方）

    ;; 启动时加载所有 snippets
    (yas-reload-all)

    ;; 展开时不发出提示音
    (setq yas-verbosity 1)

    ;; 允许在任意位置嵌套展开
    (setq yas-triggers-in-field t))


  ;; 2. 安装官方 snippet 集合（强烈推荐）
  (use-package yasnippet-snippets
    :ensure t
    :after yasnippet)



  ;; 4. 与 consult / vertico 集成（可选，用于搜索 snippet）
  (use-package consult-yasnippet
    :after (consult yasnippet)
    :bind (("C-c y" . consult-yasnipp )
           ))
           


#+end_src
** PLANNING [#B] avy ace-window amx expand-region
虽然已经在用了,但是没有完全用明白.
大体懂得 =filtering-selecting-acting= 的概念.
expand-region的缩小选择功能我还挺喜欢的
#+begin_src emacs-lisp :tangle ./post-init.el

  (use-package avy
    :bind (
  ;;         ("C-." . avy-goto-char-timer)
                                          ;     ("C-。". avy-goto-char-timer)
           ("C-;" . avy-goto-line)
                                          ;           ("C-u C-;" . avy-goto-word-0)
           ("M-g w" . avy-goto-word-0)
           ("M-g W" . avy-goto-char)
           ("M-g 2" . avy-goto-char-2)
           ("M-g c" . avy-goto-char-timer)
           ("M-g k" . avy-kill-region)
           ("M-g K" . avy-kill-ring-save-region)
           ;;             avy-goto-char-in-line
           ;;               avy-zap
                                          ;("C-c C-j" . avy-resume)
           )
    :custom
    (avy-timeout-seconds 0.3)
    (avy-style 'at-full)
    (avy-all-windows t)
    (avy-background t)
    (avy-single-candidate-jump t)
    (avy-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :config
    ;;(define-key isearch-mode-map (kbd "C-'") 'avy-isearch)
    )
(use-package ace-pinyin
  :ensure t
  :after avy
  :config
  (setq ace-pinyin-use-avy t)           ;; 明确用 avy 后端
  (ace-pinyin-global-mode +1))          ;; 全局开启

  (use-package ace-window
    :bind ("C-x o" . ace-window)
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

  (use-package amx
    :defer 0.2
    :config
    (amx-mode 1))


  (use-package expreg
    :bind( ("C-=" . expreg-expand)
           ("C--" . expreg-contract)))
#+end_src
** mwim 能智能C-a C-e
#+begin_src emacs-lisp :tangle ./post-init.el

  (use-package mwim
    :ensure t
    :bind
    ("C-a" . mwim-beginning-of-code-or-line)
    ("C-e" . mwim-end-of-code-or-line))
#+end_src
