post-init.org
** corfu 代码补全
Corfu
pangu 这个是用来给中英文之间自动加空格的.
图标问题没解决
#+begin_src emacs-lisp :tangle ./post-init.el

  (use-package corfu
    :demand t
    :bind (:map corfu-map
                ("TAB" . corfu-next)
                ([tab] . corfu-next)
                ("S-TAB" . corfu-previous)
                ([backtab] . corfu-previous)
                ("C-j" . corfu-next)
                ("C-k" . corfu-previous)
                ("RET" . corfu-insert)
                ([return] . corfu-insert)
                ("C-g" . corfu-quit)
                ("M-SPC" . corfu-insert-separator)
                ("M-d" . corfu-popupinfo-toggle)
                ("M-n" . corfu-popupinfo-scroll-up)
                ("M-p" . corfu-popupinfo-scroll-down)
                ("M-q" . corfu-quick-complete)
                ("C-q" . corfu-quick-insert))
    :custom
    (corfu-auto t)
    (corfu-auto-delay 0.1)
    (corfu-auto-prefix 2)
    (corfu-cycle t)
    (corfu-preselect 'prompt)
    (corfu-scroll-margin 5)
    (corfu-count 12)
    (corfu-max-width 60)
    (corfu-popupinfo-delay '(0.5 . 0.2))
    (corfu-popupinfo-max-width 70)
    (corfu-popupinfo-max-height 20)
    :init
    (global-corfu-mode)
    (corfu-popupinfo-mode)
    (corfu-history-mode)
    :config
    ;; 终端支持
    (unless (display-graphic-p)
      (require 'corfu-terminal)
      (corfu-terminal-mode +1))
    ;; 保存历史
    (with-eval-after-load 'savehist
      (add-to-list 'savehist-additional-variables 'corfu-history)))

  (use-package nerd-icons-corfu
    :after corfu
    :demand t
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)
    (setq nerd-icons-corfu-mapping
          '((array :style "cod" :icon "symbol_array" :face font-lock-type-face)
            (boolean :style "cod" :icon "symbol_boolean" :face font-lock-builtin-face)
            ;; You can alternatively specify a function to perform the mapping,
            ;; use this when knowing the exact completion candidate is important.
            ;; Don't pass `:face' if the function already returns string with the
            ;; face property, though.
            (file :fn nerd-icons-icon-for-file :face font-lock-string-face)
            ;; ...
            (t :style "cod" :icon "code" :face font-lock-warning-face)))
    )

  (use-package corfu-terminal
    :ensure t)

  (use-package yasnippet-capf
    :ensure t
    :after yasnippet
    :config
    (add-to-list 'completion-at-point-functions #'yasnippet-capf))
  (use-package cape
    :init
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-keyword)
    :bind (("C-c p p" . completion-at-point)
           ("C-c p d" . cape-dabbrev)
           ("C-c p f" . cape-file)
           ("C-c p k" . cape-keyword)
           ("C-c p s" . cape-symbol)
           ("C-c p a" . cape-abbrev)
           ("C-c p l" . cape-line))
    :config
    )

#+end_src
** Embark/Which key
embark 还没配置好
#+begin_src emacs-lisp :tangle ./post-init.el

  ;; (use-package embark
  ;;   :bind (("C-," . embark-act)
  ;;          ;;("C-;" . embark-dwim)
  ;;          ("C-h B" . embark-bindings)
  ;;          :map minibuffer-local-map
  ;;          ("C-." . embark-act)
  ;;          ("C-c C-e" . embark-export))
  ;;   :custom
  ;;   (embark-quit-after-action nil)
  ;;   (prefix-help-command #'embark-prefix-help-command)
  ;;   :init
  ;;   ;; Which-key 集成
  ;;   (defun embark-which-key-indicator ()
  ;;     (lambda (&optional keymap targets prefix)
  ;;       (if (null keymap)
  ;;           (which-key--hide-popup-ignore-command)
  ;;         (which-key--show-keymap
  ;;          (if (eq (plist-get (car targets) :type) 'embark-become)
  ;;              "Become"
  ;;            (format "Act on %s '%s'%s"
  ;;                    (plist-get (car targets) :type)
  ;;                    (embark--truncate-target (plist-get (car targets) :target))
  ;;                    (if (cdr targets) "…" "")))
  ;;          keymap nil nil 'no-paging)
  ;;         #'which-key--hide-popup-ignore-command)))
  ;;   (setq embark-indicators
  ;;         '(embark-which-key-indicator
  ;;           embark-highlight-indicator
  ;;           embark-isearch-highlight-indicator))
  ;;   (setq embark-action-indicator #'embark-which-key-indicator
  ;;         embark-become-indicator #'embark-which-key-indicator)
  ;;   :config
  ;;   (defun embark--truncate-target (target)
  ;;     (if (and (stringp target) (> (length target) 30))
  ;;         (concat (substring target 0 27) "...")
  ;;       target)))

  (use-package embark
    :bind (("C-,"   . embark-act)
           ("C-M-," . embark-dwim)        ; 智能猜测最可能的操作
           ("C-h B" . embark-bindings)    ; 列出所有可用绑定
           :map minibuffer-local-map
           ("C-."   . embark-act)         ; minibuffer 里用 C-.
           ("C-c C-e" . embark-export)
           :map org-mode-map
           ("C-," . embark-act))   ; 导出候选列表
    :custom
    (embark-quit-after-action nil)        ; 执行 action 后不退出，方便连续操作
    (prefix-help-command #'embark-prefix-help-command)
    :init
    (defun embark-which-key-indicator ()
      (lambda (&optional keymap targets prefix)
        (if (null keymap)
            (which-key--hide-popup-ignore-command)
          (which-key--show-keymap
           (if (eq (plist-get (car targets) :type) 'embark-become)
               "Become"
             (format "Act on %s '%s'%s"
                     (plist-get (car targets) :type)
                     (embark--truncate-target (plist-get (car targets) :target))
                     (if (cdr targets) "…" "")))
           keymap nil nil 'no-paging))
        #'which-key--hide-popup-ignore-command))  ; ← 修复：移到外层括号之后
    (setq embark-indicators
          '(embark-which-key-indicator
            embark-highlight-indicator
            embark-isearch-highlight-indicator))
    (setq embark-action-indicator #'embark-which-key-indicator
          embark-become-indicator #'embark-which-key-indicator)
    :config
    (defun embark--truncate-target (target)
      (if (and (stringp target) (> (length target) 30))
          (concat (substring target 0 27) "...")
        target)))

  (use-package embark-consult
    :after (embark consult)
    :demand t
    :hook (embark-collect-mode . consult-preview-at-point-mode))

  (use-package which-key
    :demand t
    :custom
    (which-key-idle-delay 0.5)
    (which-key-popup-type 'side-window)
    (which-key-side-window-location 'bottom)
    (which-key-side-window-max-height 0.25)
    (which-key-sort-order 'which-key-key-order-alpha)
    :init
    (which-key-mode))
#+end_src
** TODO projectile
#+begin_src emacs-lisp :tangle ./post-init.el
  (use-package projectile
    :defer 0.2
    ;; 常用设置（可以根据需要增删）
    :custom
    (projectile-project-search-path '("~/projects/" "~/work/" "~/playground" "~/Documents/"))
    (projectile-files-command "ripgrep --files --hidden --follow --glob '!.git'") 
    :config
    (define-key projectile-mode-map (kbd "C-c C-p") 'projectile-command-map)
    (global-set-key (kbd "C-c C-p") 'projectile-command-map)

    (projectile-mode +1)
    )
#+end_src
