post-init.el
(use-package vertico
  :demand t
  :bind (:map vertico-map
              ("C-j" . vertico-next)
              ("C-k" . vertico-previous)
              ("C-f" . vertico-exit)
              ("<escape>" . minibuffer-keyboard-quit))
  :custom
  (vertico-scroll-margin 0)
  (vertico-count 15)
  (vertico-cycle t)
  :init
  (vertico-mode))

;; Orderless - 灵活的匹配样式
(use-package orderless
  :demand t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

;; Marginalia - 补全注释
(use-package marginalia
  :demand t
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode))

;; Consult - 增强的搜索和导航
(use-package consult
  :bind (;; C-c 前缀
         ("C-c h" . consult-history)
         ("C-c m" . consult-mode-command)
         ("C-c k" . consult-kmacro)
         ;; C-x 前缀
         ("C-x M-:" . consult-complex-command)
         ("C-x b" . consult-buffer)
         ("C-x 4 b" . consult-buffer-other-window)
         ("C-x 5 b" . consult-buffer-other-frame)
         ("C-x r b" . consult-bookmark)
         ;; 其他
         ("M-y" . consult-yank-pop)
         ("C-s" . consult-line)
         ("M-g g" . consult-goto-line)
         ("M-g o" . consult-outline)
         ("M-g i" . consult-imenu)
         ;; M-s 前缀
         ("M-s d" . consult-fd)
         ("M-s r" . consult-ripgrep)
         ("M-s l" . consult-line)
         :map isearch-mode-map
         ("M-e" . consult-isearch-history)
         ("M-s l" . consult-line)
         :map minibuffer-local-map
         ("M-s" . consult-history)
         ("M-r" . consult-history))
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  :config
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   :preview-key "M-.")
  (setq consult-async-min-input 2)
  (setq consult-narrow-key "<"))

;; (use-package casual-suite
;; 
;;     :bind (;; 全局入口：在任何支持的 Buffer 中一键唤起
;;            ("M-j" . casual-avy-tmenu)
;;            ("C-o" . casual-editkit-main-tmenu)
;;            ("M-m" ' casual-suite-tmenu)
;;            ;; 如果你习惯在特定模式下使用更直观的快捷键
;;            :map calc-mode-map ("M-m" . casual-calc-tmenu)
;; ;;           :map isearch-mode-map ("M-m" . )
;;            :map dired-mode-map ("M-m" . casual-dired-tmenu)
;;            :map org-mode-map ("M-m" . casual-org-tmenu)
;;            :map org-table-fedit-map ("M-m" . casual-org-table-fedit-tmenu)
;;            :map org-agenda-mode-map ("M-m" . casual-agenda-tmenu)
;;            :map ibuffer-mode-map ("M-m" . casual-ibuffer-tmenu)
;;            :map bookmark-bmenu-mode-map ("M-m" . casual-bookmarks-tmenu)
;;            :map calendar-mode-map ("M-m" . casual-calendar-tmenu)
;;            :map compilation-mode-map ("M-m" . casual-compile-tmenu)
;;            ;;           :map eww-mode-map ("M-m" . casual-eww-tmenu)
;;            :map help-mode-map ("M-m" . casual-help-tmenu)
;;            :map Info-mode-map ("M-m" . casual-info-tmenu)
;;            ;;:map re-builder-mode-map ("M-m" . casual-re-builder-tmenu)
;;            ;;  :map shell-mode-map ("M-m" . casual-eshell-tmenu)
;;            :map image-mode-map ("M-m" . casual-image-tmenu)
;;            )
;; 
;;     :config
;;     )

(use-package casual-suite
:bind
(("M-j" . casual-avy-tmenu)
 ("C-o" . casual-editkit-main-tmenu)
 ("M-m" . casual-suite-tmenu)


 
 :map calc-mode-map
 ("M-m" . casual-calc-tmenu)

 :map dired-mode-map
 ("M-m" . casual-dired-tmenu)

 :map org-mode-map
 ("M-m" . casual-org-tmenu)

 :map org-table-fedit-map
 ("M-m" . casual-org-table-fedit-tmenu)

 :map org-agenda-mode-map
 ("M-m" . casual-agenda-tmenu)

 :map ibuffer-mode-map
 ("M-m" . casual-ibuffer-tmenu)

 :map bookmark-bmenu-mode-map
 ("M-m" . casual-bookmarks-tmenu)

 :map calendar-mode-map
 ("M-m" . casual-calendar-tmenu)

 :map compilation-mode-map
 ("M-m" . casual-compile-tmenu)

 :map help-mode-map
 ("M-m" . casual-help-tmenu)

 :map Info-mode-map
 ("M-m" . casual-info-tmenu)

 :map image-mode-map
 ("M-m" . casual-image-tmenu)))



(use-package rime
  :custom
  (default-input-method "rime")
  :config
  (setq rime-show-candidate 'posframe)
  (setq rime-cursor "█")
  (setq rime-cursor-face '((t (:foreground "#00ff00"))))
  (setq rime-show-preedit t)
  (setq rime-user-data-dir "~/.config/fcitx/Rime/")
  ;; 默认值
  (setq rime-translate-keybindings
        '("C-f" "C-b" "C-n" "C-p" "C-g" "<left>" "<right>" "<up>" "<down>" "<prior>" "<next>" "<delete>"))
  
  (defun my/update-cursor-by-ime ()
    "根据当前输入法状态实时更新光标颜色."
    (set-cursor-color (if current-input-method "#a7c080" "#51afef")))

  (add-hook 'post-command-hook #'my/update-cursor-by-ime)
  )

;; 中文英文之间插入空格
(use-package pangu-spacing
  :defer 0.3
  :config
  (global-pangu-spacing-mode +1))

(global-set-key (kbd "C-x C-\\") 'skk-mode)


(use-package ddskk
  :ensure t
  :init
  (setq skk-jisyo "~/.skk-jisyo")
  (setq skk-large-jisyo "~/.emacs.d/skk-get-jisyo/SKK-JISYO.L")

  (setq skk-extra-jisyo-file-list
        '("/usr/share/skk/SKK-JISYO.jinmei"
          "/usr/share/skk/SKK-JISYO.geo"))
  :config
  (setq skk-use-auto-fill t)
  (setq skk-save-jisyo-instantly t))

(use-package quick-sdcv
  :ensure t
  :bind (("C-c D" . quick-sdcv-search-at-point)
         ("C-c d" . quick-sdcv-search-input))
  
  :custom
  (quick-sdcv-dictionary-data-dir "~/Ingrediant/dictionary/")
  (quick-sdcv-unique-buffers t)
  (quick-sdcv-dictionary-prefix-symbol "►")
  (quick-sdcv-ellipsis " ▼"))

;; 推荐组合：auth-source + pass 的桥接 + 好用的界面
(use-package auth-source
  :ensure t
  :config
  (add-to-list 'auth-sources 'password-store))   ; 关键这行

(use-package auth-source-pass
  :ensure t
  :after auth-source
  :config
  (auth-source-pass-enable))

;; (use-package pass
;;   :ensure t
;;   :bind ("C-c p p" . pass))

(use-package password-store-menu
  :ensure t
  :bind ("C-c P" . password-store-menu))

;; (use-package listen)  
;; (use-package emms
;;   :defer t
;;   :config
;;   
;; 
;;   (emms-all)
;;   (setq emms-player-list '(emms-player-mpv)
;;         emms-info-functions '(emms-info-native))
;; 
;;   )

(use-package ibuffer
  :ensure nil                  ; ibuffer 是 Emacs 内置，不需要从 MELPA 安装
  :bind
  ("C-x C-b" . ibuffer)        ; 覆盖默认 C-x C-b 的 list-buffers，用 ibuffer 代替

  :custom
  (ibuffer-default-sorting-mode 'major-mode)        ; 按 major-mode 排序
  (ibuffer-show-empty-filter-groups nil)            ; 隐藏空分组

  :hook
  (ibuffer-mode . ibuffer-auto-mode)                ; 打开 ibuffer 时自动开启分组并实时更新
  )
