post-init.org
** treemacs 和 未整理杂项    
#+begin_src emacs-lisp :tangle ./post-init.el

  ;; (use-package treemacs
  ;;   :ensure t
  ;;   :defer t
  ;;   :init
  ;;   (with-eval-after-load 'winum
  ;;     (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  ;;   :config
  ;;   (progn
  ;;     (setq treemacs-buffer-name-function            #'treemacs-default-buffer-name
  ;;           treemacs-buffer-name-prefix              " *Treemacs-Buffer-"
  ;;           treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
  ;;           treemacs-deferred-git-apply-delay        0.5
  ;;           treemacs-directory-name-transformer      #'identity
  ;;           treemacs-display-in-side-window          t
  ;;           treemacs-eldoc-display                   'simple
  ;;           treemacs-file-event-delay                2000
  ;;           treemacs-file-extension-regex            treemacs-last-period-regex-value
  ;;           treemacs-file-follow-delay               0.2
  ;;           treemacs-file-name-transformer           #'identity
  ;;           treemacs-follow-after-init               t
  ;;           treemacs-expand-after-init               t
  ;;           treemacs-find-workspace-method           'find-for-file-or-pick-first
  ;;           treemacs-git-command-pipe                ""
  ;;           treemacs-goto-tag-strategy               'refetch-index
  ;;           treemacs-header-scroll-indicators        '(nil . "^^^^^^")
  ;;           treemacs-hide-dot-git-directory          t
  ;;           treemacs-hide-dot-jj-directory           t
  ;;           treemacs-indentation                     2
  ;;           treemacs-indentation-string              " "
  ;;           treemacs-is-never-other-window           nil
  ;;           treemacs-max-git-entries                 5000
  ;;           treemacs-missing-project-action          'ask
  ;;           treemacs-move-files-by-mouse-dragging    t
  ;;           treemacs-move-forward-on-expand          nil
  ;;           treemacs-no-png-images                   nil
  ;;           treemacs-no-delete-other-windows         t
  ;;           treemacs-project-follow-cleanup          nil
  ;;           treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
  ;;           treemacs-position                        'left
  ;;           treemacs-read-string-input               'from-child-frame
  ;;           treemacs-recenter-distance               0.1
  ;;           treemacs-recenter-after-file-follow      nil
  ;;           treemacs-recenter-after-tag-follow       nil
  ;;           treemacs-recenter-after-project-jump     'always
  ;;           treemacs-recenter-after-project-expand   'on-distance
  ;;           treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
  ;;           treemacs-project-follow-into-home        nil
  ;;           treemacs-show-cursor                     nil
  ;;           treemacs-show-hidden-files               t
  ;;           treemacs-silent-filewatch                nil
  ;;           treemacs-silent-refresh                  nil
  ;;           treemacs-sorting                         'alphabetic-asc
  ;;           treemacs-select-when-already-in-treemacs 'move-back
  ;;           treemacs-space-between-root-nodes        t
  ;;           treemacs-tag-follow-cleanup              t
  ;;           treemacs-tag-follow-delay                1.5
  ;;           treemacs-text-scale                      nil
  ;;           treemacs-user-mode-line-format           nil
  ;;           treemacs-user-header-line-format         nil
  ;;           treemacs-wide-toggle-width               70
  ;;           treemacs-width                           35
  ;;           treemacs-width-increment                 1
  ;;           treemacs-width-is-initially-locked       t
  ;;           treemacs-workspace-switch-cleanup        nil)
  ;; 
  ;;     ;; The default width and height of the icons is 22 pixels. If you are
  ;;     ;; using a Hi-DPI display, uncomment this to double the icon size.
  ;;     ;;(treemacs-resize-icons 44)
  ;; 
  ;;     (treemacs-follow-mode t)
  ;;     (treemacs-filewatch-mode t)
  ;;     (treemacs-fringe-indicator-mode 'always)
  ;;     (when treemacs-python-executable
  ;;       (treemacs-git-commit-diff-mode t))
  ;; 
  ;;     (pcase (cons (not (null (executable-find "git")))
  ;;                  (not (null treemacs-python-executable)))
  ;;       (`(t . t)
  ;;        (treemacs-git-mode 'deferred))
  ;;       (`(t . _)
  ;;        (treemacs-git-mode 'simple)))
  ;; 
  ;;     (treemacs-hide-gitignored-files-mode nil))
  ;;   :bind
  ;;   (:map global-map
  ;;         ("M-0"       . treemacs-select-window)
  ;;         ("C-x t 1"   . treemacs-delete-other-windows)
  ;;         ("C-x t t"   . treemacs)
  ;;         ("C-x t d"   . treemacs-select-directory)
  ;;         ("C-x t B"   . treemacs-bookmark)
  ;;         ("C-x t C-t" . treemacs-find-file)
  ;;         ("C-x t M-t" . treemacs-find-tag)))


  ;; (use-package treemacs-projectile
  ;;   :after (treemacs projectile)
  ;;   :ensure t)
  ;; 
  ;; (use-package treemacs-icons-dired
  ;;   :hook (dired-mode . treemacs-icons-dired-enable-once)
  ;;   :ensure t)
  ;; 
  ;; (use-package treemacs-magit
  ;;   :after (treemacs magit)
  ;;   :ensure t)
  ;; 
  ;; (use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
  ;;   :after (treemacs persp-mode) ;;or perspective vs. persp-mode
  ;;   :ensure t
  ;;   :config (treemacs-set-scope-type 'Perspectives))
  ;; 
  ;; (use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
  ;;   :after (treemacs)
  ;;   :ensure t
  ;;   :config (treemacs-set-scope-type 'Tabs))
  ;; 
  ;; (treemacs-start-on-boot)

#+end_src
** flycheck magit rainbow-delimiters
#+begin_src emacs-lisp :tangle ./post-init.el



  (use-package flycheck
    :hook (prog-mode . flycheck-mode)
    :custom
    (flycheck-display-errors-delay 0.3))

  (use-package magit
    :bind ("C-x g" . magit-status)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package rainbow-delimiters
    :hook
    ;; 最常用写法：在所有编程模式下自动启用（强烈推荐）
    (prog-mode . rainbow-delimiters-mode)

    ;; 可选：如果你还想在某些非 prog-mode 的地方也启用，比如 REPL、org-src 等
    ;; (emacs-lisp-mode . rainbow-delimiters-mode)
    ;; (clojure-mode  . rainbow-delimiters-mode)
    ;; (inferior-ess-mode . rainbow-delimiters-mode)   ;; R 的 REPL
    )
#+end_src
** 终端相关
vterm太强了,感觉跟真的终端完全没有区别.
eat我听说很厉害,但是没有怎么使用过.
#+begin_src emacs-lisp :tangle ./post-init.el


  ;; eat
  ;; (use-package eat
  ;;   )

  ;; vterm
  (use-package vterm
    :bind
    ("C-c t" . vterm)
    :config
    ;; (add-hook 'vterm-mode-hook
    ;;           (lambda ()
    ;;             (setq-local global-hl-line-mode nil)))
                                          ;解决vterm闪烁
    

    :init
    
    (setq vterm-timer-delay 0.05)  ; Faster vterm
    (setq vterm-kill-buffer-on-exit t)
    (setq vterm-max-scrollback 5000)
    (defun my-vterm--setup ()

      ;; Inhibit early horizontal scrolling
      (setq-local hscroll-margin 0)

      ;; Suppress prompts for terminating active processes when closing vterm
      (setq-local confirm-kill-processes nil))
    (add-hook 'vterm-mode-hook #'my-vterm--setup)

    )
#+end_src
