post-init.org
** poper

popper 的小问题： M-` 被kde截住了

#+begin_src emacs-lisp :tangle ./post-init.el


  (use-package popper
    :bind (("C-`"   . popper-toggle)
           ("M-`"   . popper-cycle)
           ("C-M-`" . popper-toggle-type))
    :init
      (setq popper-reference-buffers
        '(;; 基础
          "\\*Messages\\*"
          "Output\\*$"
          "\\*Async Shell Command\\*"
          "\\*Warnings\\*"
          "\\*Backtrace\\*"
          calendar-mode
          flymake-diagnostics-buffer-mode
          flycheck-error-list-mode
          pdf-outline-buffer-mode
          help-mode
          compilation-mode

          ;; 终端
          "^\\*eshell.*\\*$" eshell-mode
          "^\\*shell.*\\*$"  shell-mode
          "^\\*term.*\\*$"   term-mode
          "^\\*vterm.*\\*$"  vterm-mode

          ;; LSP
          "\\*eldoc.*\\*"    eldoc-mode
          "\\*xref\\*"
          "\\*Flymake diagnostics.*\\*"

          ;; Org
          ;;"\\*Org Agenda\\*"
          "\\*Capture\\*"
          ;;"\\*org-roam\\*"

          ;; 搜索
          "\\*Occur\\*"      occur-mode
          "\\*grep\\*"       grep-mode
          "\\*ripgrep-search\\*"

          ;; Magit
          "\\*magit-diff.*\\*"
          "\\*magit-process.*\\*"

          ;; Helpful
          helpful-mode

          ;; 其他
          "\\*Dictionary\\*"
          "^\\*sdcv:.*\\*$"  sdcv-mode
          "\\.gpg$"
          "\\*Python\\*"     inferior-python-mode))
    
    (popper-mode +1)
    (popper-echo-mode +1))                ; For echo area hints
#+end_src


** helpful 更易用的help界面
#+begin_src emacs-lisp :tangle ./post-init.el
  (use-package helpful
    :ensure t
    :commands (helpful-callable
               helpful-variable
               helpful-key
               helpful-command
               helpful-at-point
               helpful-function)
    :bind
    ([remap describe-command] . helpful-command)
    ([remap describe-function] . helpful-callable)
    ([remap describe-key] . helpful-key)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-variable] . helpful-variable)
    :custom
    (helpful-max-buffers 7))
#+end_src

** Dashboard
- Note taken on [2026-03-08 日 12:00] \\
  我现在其实觉得，dashboard没什么用，我只想让emacs在启动时展示一些我想看的格言和图片

启动界面
dashboard的banner最好自己手动压缩为500x500以下


#+begin_src emacs-lisp :tangle ./post-init.el

  
#+end_src
** bufferfile
#+begin_src emacs-lisp :tangle ./post-init.el
(use-package bufferfile
  :ensure t
  :commands (bufferfile-copy
             bufferfile-rename
             bufferfile-delete)
  :custom
  ;; If non-nil, display messages during file renaming operations
  (bufferfile-verbose nil)

  ;; If non-nil, enable using version control (VC) when available
  (bufferfile-use-vc nil)

  ;; Specifies the action taken after deleting a file and killing its buffer.
  (bufferfile-delete-switch-to 'parent-directory))
#+end_src
** dired 相关
#+begin_src emacs-lisp :tangle ./post-init.el

  (use-package nerd-icons-dired
    :hook
    (dired-mode . nerd-icons-dired-mode))

  (use-package dirvish
    :init
    (dirvish-override-dired-mode)
    :bind
    ("C-x C-d" . dirvish))

#+end_src



* post-init.el ends here
#+begin_src emacs-lisp :tangle ./post-init.el

  (provide 'post-init)
  ;;; post-init.el ends here
#+end_src




* 其他
** 键位规划
=M-n M-p= 这俩特别好用的键还没用呢
=C-. M-j M-g C-o= 都可用来作transient菜单

 

** 查缺补漏


结构化编辑

=smartparens / paredit=


项目内导航

=xref=

代码大纲

=imenu / consult-imenu=

工作区跳转

=tab-bar / tabspaces=

🧾 文档 / 写作流（你已经强，但还能补）

拼写检查

=flyspell / jinx=

语法检查

=flymake / flycheck=

写作专注模式

=olivetti / writeroom=


ISP

tree-sitter（内置）

代码格式化

=aphelei时间追踪

=org-clock=

a / format-all=

调试

=dap-mode=

代码折叠

=hideshow / origami=


=vc= （很多人忽略，其实很强）

环境变量管理

=direnv / envrc=


HTTP 客户端

=restclient / verb=

API 调试
-（很多人直接用它替代 postman）

下载管理

=aria2 + aria2.el=

📚 学习 / 知识管理（你可以再往“第二大脑”扩展）

卡片记忆

=org-drill=

知识图谱增强

=org-roam-bibtex=

引用管理

=citar / org-cite=


可以升级成完整 GTD：


日志

=org-journal=

文件加密

=epa / gpg=

org 加密

=org-crypt=


动态美化

=hl-todo / rainbow-delimiters=




** 依赖
latex 
pandoc mdox
pacman -S poppler ffmpegthumbnailer mediainfo libvips 7zip imagemagick 

Org download 在 CachyOS需要 wl-clipboard

词典依赖Sdcv
pass：sudo pacman -S pass gnupg git



