post-init.el

(use-package popper
  :bind (("C-`"   . popper-toggle)
         ("M-`"   . popper-cycle)
         ("C-M-`" . popper-toggle-type))
  :init
    (setq popper-reference-buffers
      '(;; 基础
        "\\*Messages\\*"
        "Output\\*$"
        "\\*Async Shell Command\\*"
        "\\*Warnings\\*"
        "\\*Backtrace\\*"
        calendar-mode
        flymake-diagnostics-buffer-mode
        flycheck-error-list-mode
        pdf-outline-buffer-mode
        help-mode
        compilation-mode

        ;; 终端
        "^\\*eshell.*\\*$" eshell-mode
        "^\\*shell.*\\*$"  shell-mode
        "^\\*term.*\\*$"   term-mode
        "^\\*vterm.*\\*$"  vterm-mode

        ;; LSP
        "\\*eldoc.*\\*"    eldoc-mode
        "\\*xref\\*"
        "\\*Flymake diagnostics.*\\*"

        ;; Org
        ;;"\\*Org Agenda\\*"
        "\\*Capture\\*"
        ;;"\\*org-roam\\*"

        ;; 搜索
        "\\*Occur\\*"      occur-mode
        "\\*grep\\*"       grep-mode
        "\\*ripgrep-search\\*"

        ;; Magit
        "\\*magit-diff.*\\*"
        "\\*magit-process.*\\*"

        ;; Helpful
        helpful-mode

        ;; 其他
        "\\*Dictionary\\*"
        "^\\*sdcv:.*\\*$"  sdcv-mode
        "\\.gpg$"
        "\\*Python\\*"     inferior-python-mode))
  
  (popper-mode +1)
  (popper-echo-mode +1))                ; For echo area hints

(use-package helpful
  :ensure t
  :commands (helpful-callable
             helpful-variable
             helpful-key
             helpful-command
             helpful-at-point
             helpful-function)
  :bind
  ([remap describe-command] . helpful-command)
  ([remap describe-function] . helpful-callable)
  ([remap describe-key] . helpful-key)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  :custom
  (helpful-max-buffers 7))



(use-package bufferfile
  :ensure t
  :commands (bufferfile-copy
             bufferfile-rename
             bufferfile-delete)
  :custom
  ;; If non-nil, display messages during file renaming operations
  (bufferfile-verbose nil)

  ;; If non-nil, enable using version control (VC) when available
  (bufferfile-use-vc nil)

  ;; Specifies the action taken after deleting a file and killing its buffer.
  (bufferfile-delete-switch-to 'parent-directory))

(use-package nerd-icons-dired
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package dirvish
  :init
  (dirvish-override-dired-mode)
  :bind
  ("C-x C-d" . dirvish))

(provide 'post-init)
;;; post-init.el ends here
